app/Models/m_admin.php

SELECT `login`, `motPasse`, `role`
FROM `users`
WHERE `login` = 'Gaston'
---
    function connexion($infoLogin){

        $result = false;
        // connexion à la Bdd
        $db=db_connect();
        // requête
        $query = $db->table('users')
            ->select('login, motPasse, role')
            ->where('login =', $infoLogin)
            ->get();

SELECT *
FROM `questions`
WHERE `libelle` LIKE '%ee%'
SELECT *
FROM `questions`
ORDER BY `libelle` ASC
---
    function getQuestions($recherche)
    {
        $db = db_connect();
        if (!empty($recherche)) {
            $query = $db->table('questions')
                ->where("libelle LIKE '%" . $recherche . "%'");
        } else {
            $query = $db->table('questions');
        }
        $query = $query->get();

        // Retourner un tableau vide si aucune ligne n'est trouvée
        if ($query->getNumRows() > 0) {
            return $query->getResult(); // Retourne un tableau d'objets

SELECT *
FROM `questions`
 LIMIT 30, 30
---
    public function getQuestionsPageWithSearch($recherche, $limite, $offset)
    {
        $db = db_connect();
        $query = $db->table('questions')
            ->like('libelle', $recherche)  // Recherche sur le libellé
            ->limit($limite, $offset) // Limite les résultats à 30 par page
            ->get();

        if ($query->getNumRows() > 0) {
            return $query->getResult();

SELECT *
FROM `questions`
WHERE `id` = '87'
---
    function getQuestionsid($id)
    {
        return $this->db->table('questions')
            ->where('id', $id)
            ->get()
            ->getRow();