app/Models/m_auteurs.php

SELECT `nom_auteur`, `prenom_auteur`, `pseudo_auteur`, `participants`.`texte`
FROM `auteur`
JOIN `participants` ON `participants`.`auteur` = `auteur`.`id_auteur`
WHERE `participants`.`festival` = 2025
---
    function recupAuteurs($annee): bool|array
    {
        $result = false;
        $db=db_connect();
        // Récupérer la liste des auteurs du festival (année transmise)
        $query = $db->table('auteur')
            ->select("nom_auteur, prenom_auteur, pseudo_auteur, participants.texte")
            ->join('participants','participants.auteur = auteur.id_auteur')
            ->where('participants.festival = ',$annee)
            ->get();