app/Models/m_expositions.php

SELECT `titre_livre`, `serie_id`, `numTome_livre`, `image_livre`, `dateParution_livre`
FROM `livre`
JOIN `collaborer` ON `collaborer`.`livre_isbn` = `livre`.`isbn_livre`
JOIN `auteur` ON `collaborer`.`auteur_id` = `auteur`.`id_auteur`
WHERE `auteur`.`nom_auteur` = 'Liégeois'
AND `auteur`.`prenom_auteur` = 'Philippe'
ORDER BY `serie_id` ASC
---
    function recupExpositions($auteurNom, $auteurPrenom){
        $result = false;
        $db=db_connect();
        // Récupérer la liste des bandes dessinées de l'auteur
        $query = $db->table('livre')
            ->select("titre_livre, serie_id, numTome_livre, image_livre, dateParution_livre")
            ->join('collaborer','collaborer.livre_isbn = livre.isbn_livre')
            ->join('auteur','collaborer.auteur_id = auteur.id_auteur')
            ->where('auteur.nom_auteur = ',$auteurNom)
            ->where('auteur.prenom_auteur = ',$auteurPrenom)
            ->orderBy('serie_id', 'ASC')
            ->get();