app/Models/m_ludique.php

    function genereAlea($nombreQuestion, $themeQuestion){
        $db=db_connect();
        $numQuestionsAleatoires = $db->table('questions')
            ->select("questions.id")
            ->whereIn('questions.theme', $themeQuestion)
            ->orderBy("RAND()")
            ->limit($nombreQuestion)  // 8 questions aléatoires
            ->get()
            ->getResultArray();
---
SELECT `questions`.`id`
FROM `questions`
WHERE `questions`.`theme` IS NULL
ORDER BY RAND()
 LIMIT 8

    function recupQuestionsReponses($nombreQuestion, $themeQuestion)
    {
        $db = db_connect();
        $listeNumero = $this->genereAlea($nombreQuestion, $themeQuestion);
        if (!$listeNumero) {
            return false;
        }

        // Récupérer les questions et leurs propositions associées
        $query = $db->table('questions')
            ->select("questions.id as question_id, questions.libelle as question, questions.image, propositions.numero as proposition_id, propositions.libelle as reponse, associer.est_correcte")
            ->join('associer', 'associer.question_id = questions.id')
            ->join('propositions', 'propositions.numero = associer.proposition_id')
            ->whereIn('questions.id', $listeNumero)
            ->orderBy("questions.libelle")
            ->get();

        // Organiser les résultats pour inclure les propositions dans chaque question
        $result = $query->getResult();
---
SELECT `propositions`.`numero` as `proposition_id`, `propositions`.`libelle` as `reponse`, `associer`.`question_id`, `associer`.`est_correcte`
FROM `propositions`
JOIN `associer` ON `associer`.`proposition_id` = `propositions`.`numero`
WHERE `associer`.`question_id` IN ('40','30','71','41')
SELECT `questions`.`id` as `id`, `questions`.`libelle` as `question`, `questions`.`image` as `image`, `propositions`.`libelle` as `reponse`, `est_correcte`
FROM `questions`
JOIN `associer` ON `associer`.`question_id` = `questions`.`id`
JOIN `propositions` ON `propositions`.`numero` = `associer`.`proposition_id`
WHERE `questions`.`id` IN ('31','73','21','5','24','42','11','30','44','37')
AND `questions`.`theme` = 'Bd'
ORDER BY `questions`.`libelle`
SELECT `questions`.`id` as `id`, `questions`.`libelle` as `question`, `propositions`.`libelle` as `reponse`, `est_correcte`
FROM `questions`
JOIN `associer` ON `associer`.`question_id` = `questions`.`id`
JOIN `propositions` ON `propositions`.`numero` = `associer`.`proposition_id`
WHERE `associer`.`est_correcte` = true
AND `questions`.`id` IN ('28','38','42','41','17','30','64','50')
ORDER BY `questions`.`libelle`
SELECT `propositions`.`numero` AS `proposition_id`, `propositions`.`libelle` AS `reponse`, `associer`.`question_id` AS `question_id`, `associer`.`est_correcte` AS `est_correcte`
FROM `propositions`
JOIN `associer` ON `associer`.`proposition_id` = `propositions`.`numero`
WHERE `associer`.`question_id` IN ('17','6')

    function recupQuestionsBonneReponse(){
        $result = false;
        $db=db_connect();
        // Récupérer la liste des questions depuis la session
        $listeNumero = session()->get('listeNumero');
        $query = $db->table('questions')
            ->select("questions.id as id, questions.libelle as question, propositions.libelle as reponse,est_correcte")
            ->join('associer','associer.question_id = questions.id')
            ->join('propositions', 'propositions.numero = associer.proposition_id')
            ->where('associer.est_correcte = true')
            ->whereIn ( 'questions.id' ,$listeNumero)
            ->orderBy("questions.libelle")
            ->get();
---
SELECT `questions`.`id` AS `id`, `questions`.`libelle` AS `question`, `propositions`.`libelle` AS `reponse`, `associer`.`est_correcte`
FROM `questions`
JOIN `associer` ON `associer`.`question_id` = `questions`.`id`
JOIN `propositions` ON `propositions`.`numero` = `associer`.`proposition_id`
WHERE `questions`.`id` IN ('48','14','76','30','65','47','17','28')
AND `associer`.`est_correcte` = 1